EmilVu/emilvu.github.io/files/ece299-alarm-clock/code/alarm_clock_stm32f4.c
//
//   EEEEE   CCC   EEEEE   222    999    999
//   E      C   C  E      2   2  9   9  9   9
//   E      C      E          2  9   9  9   9
//   EEEEE  C      EEEEE     2    9999   9999
//   E      C      E        2        9      9
//   E      C   C  E       2        9      9
//   EEEEE   CCC   EEEEE  22222   99     99
//
//
//    AAA   L       AAA    RRRR   M   M       CCC   L       OOO    CCC   K   K
//   A   A  L      A   A   R   R  MM MM      C   C  L      O   O  C   C  K  K
//   A   A  L      A   A   R   R  M M M      C      L      O   O  C      K K
//   AAAAA  L      AAAAA   RRRR   M   M      C      L      O   O  C      KK
//   A   A  L      A   A   R R    M   M      C      L      O   O  C      K K
//   A   A  L      A   A   R  R   M   M      C   C  L      O   O  C   C  K  K
//   A   A  LLLLL  A   A   R   R  M   M       CCC   LLLLL   OOO    CCC   K   K
//
// Version 1.01
//
// ----------------------------------------------------------------------------

#include <stdio.h>
#include <stdlib.h>
#include "diag/Trace.h"
#include "stm32f4xx_hal.h"
//#include "Timer.h"


#define CLOCK_HOUR_FORMAT_12    (0)       // Display the time with AM/PM format
#define CLOCK_HOUR_FORMAT_24    (1)       // Display the time with 24 Hour format

#define TRUE	( 1 == 1 )
#define FALSE	( 1 == 0 )

//
// Disable specific warnings
//

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunused-parameter"
#pragma GCC diagnostic ignored "-Wmissing-declarations"
#pragma GCC diagnostic ignored "-Wreturn-type"

//
// remove comment slashes on line below to enable real time clock support
//
#define USE_RTC

// ----------------------------------------------------------------------------
//
// Standalone STM32F4 Simple Alarm Clock Stub Code
//
// This code just plays an MP3 file off of a connected USB flash drive.
//
// Trace support is enabled by adding the TRACE macro definition.
// By default the trace messages are forwarded to the DEBUG output,
// but can be rerouted to any device or completely suppressed, by
// changing the definitions required in system/src/diag/trace_impl.c
// (currently OS_USE_TRACE_ITM, OS_USE_TRACE_SEMIHOSTING_DEBUG/_STDOUT).
//

void
	Display7Segment( void ),
	SetTime( void ),
	SetAlarm( void ),
	Snooze( void ),
	ProcessButtons( void ),
	GetCurrentTime( void ),
	SystemClock_Config( void );


uint16_t
	CheckButtons( void );


//
// Global variables
//

#ifdef USE_RTC

RTC_InitTypeDef
	ClockInit;				// Structure used to initialize the real time clock

RTC_HandleTypeDef
	RealTimeClock;			// Structure for the real time clock subsystem

RTC_TimeTypeDef
	ClockTime;				// Structure to hold/store the current time

RTC_DateTypeDef
	ClockDate;				// Structure to hold the current date

RTC_AlarmTypeDef
	ClockAlarm;				// Structure to hold/store the current alarm time

#endif



TIM_HandleTypeDef
	DisplayTimer;			// Structure for the LED display timer subsystem



volatile int
	Alarm = FALSE,			// Flag indicating alarm
	DebounceCount1 = 0,		// Buttons debounce count
    DebounceCount2 = 0,
    DebounceCount3 = 0,
    DebounceCount4 = 0,
    DebounceCount5 = 0,
	a = 0,
	b = 0;

volatile uint16_t
	ButtonsPushed = 0x0000;			// Bit field containing the bits of which buttons have been pushed

volatile int
	BcdTime[4],				// Array to hold the hours and minutes in BCD format
	DisplayedDigit = 0,		// Current digit being displayed on the LED display
    Button1,
	Button2,
	Button3,
	Button4,
	Button5,
	SelectedDigitAlarm = 0,
	SelectedDigitClock = 0,
	DisplayMode = 1,
							// Current format for the displayed time ( IE 12 or 24 hour format )
	ClockHourFormat = CLOCK_HOUR_FORMAT_12,
	AlarmPmFlag = 0,
	TimePmFlag = 0;

void ConfigureDisplay( void )
{
//	GPIO_InitTypeDef
//		GPIO_InitStructure;

//
//  Enable clocks for PWR_CLK for RTC, GPIOE, GPIOD, GPIOC and TIM5.
//

//
// Enable the LED multiplexing display and push button timer (TIM5) at a frequency of 250Hz
//

//
// Configure the 7 segments, 5 digit controls and alarm signal as outputs
//

//
// Configure the push button switches ( maximum 6 ) as inputs with pull-ups
//

	__HAL_RCC_GPIOD_CLK_ENABLE(); // enabling clock for port E
	__HAL_RCC_GPIOE_CLK_ENABLE(); // enabling clock for port D
	__HAL_RCC_GPIOC_CLK_ENABLE(); // enabling clock for port C
	__HAL_RCC_GPIOA_CLK_ENABLE(); // enabling clock for port A(TIM5)
	__HAL_RCC_RTC_ENABLE(); // enabling clock for RTC

	GPIO_InitTypeDef GPIO_InitStructure; // handle for pointing GPIO
	GPIO_InitStructure.Pin = GPIO_PIN_1;// assign pin 1 as timer
	GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP; //set mode to output
	GPIO_InitStructure.Speed = GPIO_SPEED_LOW; // set speed to be low
	GPIO_InitStructure.Pull = GPIO_NOPULL; // assign no pull-up resistor
	GPIO_InitStructure.Alternate = GPIO_AF2_TIM5; // assign TIM5 alternate function

	HAL_GPIO_Init(GPIOA, &GPIO_InitStructure); // initialize port A with the handle

	__HAL_RCC_TIM5_CLK_ENABLE();
	DisplayTimer.Instance = TIM5;
	DisplayTimer.Init.Prescaler = 839;
	DisplayTimer.Init.CounterMode = TIM_COUNTERMODE_UP;
	DisplayTimer.Init.Period = 399 ;
	DisplayTimer.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
	DisplayTimer.Init.RepetitionCounter = 0;
	HAL_TIM_Base_Init( &DisplayTimer );
	// Set priority for the interrupt.
	// Value 0 corresponds to highest priority.

		HAL_NVIC_SetPriority( TIM5_IRQn, 0, 0);

	//Enable interrupt function request of Timer5
		HAL_NVIC_EnableIRQ( TIM5_IRQn );


	// Enable timer interrupt flag to be set when timer count is
	// reached
		__HAL_TIM_ENABLE_IT( &DisplayTimer, TIM_IT_UPDATE );

	// Enable timer to start
		__HAL_TIM_ENABLE( &DisplayTimer );


	GPIO_InitTypeDef GPIO_InitStructure1; // handle for pointing GPIO
	GPIO_InitStructure1.Pin = GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3|GPIO_PIN_6|GPIO_PIN_7|GPIO_PIN_8|GPIO_PIN_9;// assign pins 0 for Alarm, and 1,2,3,6,7,8,9 for led segments a-g
	GPIO_InitStructure1.Mode = GPIO_MODE_OUTPUT_PP; //set mode to be push-pull output
	GPIO_InitStructure1.Speed = GPIO_SPEED_LOW; // set speed to be low
	GPIO_InitStructure1.Pull = GPIO_NOPULL; // assign no pull-up resistor
	GPIO_InitStructure1.Alternate = 0; // assign no alternate function

	HAL_GPIO_Init(GPIOD, &GPIO_InitStructure1); // initialize port D with the handle

	GPIO_InitTypeDef GPIO_InitStructure2; // handle for pointing GPIO
	GPIO_InitStructure2.Pin = GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6;// assign pins 1,2,4,5 for digit control and 6 for dots
	GPIO_InitStructure2.Mode = GPIO_MODE_OUTPUT_PP; //set mode to output
	GPIO_InitStructure2.Speed = GPIO_SPEED_LOW; // set speed to be low
	GPIO_InitStructure2.Pull = GPIO_NOPULL; // assign pull-up resistor
	GPIO_InitStructure2.Alternate = 0; // assign no alternate function

