EmilVu/emilvu.github.io/files/ece299-alarm-clock/code/alarm_clock_stm32f4.c
	HAL_GPIO_Init(GPIOC, &GPIO_InitStructure2); // initialize port C with the handle

	GPIO_InitTypeDef GPIO_InitStructure3; // handle for pointing GPIO
	GPIO_InitStructure3.Pin = GPIO_PIN_2|GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_8;// assign pins 2 and 4 for button 1 and 2
	GPIO_InitStructure3.Mode = GPIO_MODE_INPUT; //set mode to input
	GPIO_InitStructure3.Speed = GPIO_SPEED_LOW; // set speed to be low
	GPIO_InitStructure3.Pull = GPIO_PULLUP; // assign pull-up resistor
	GPIO_InitStructure3.Alternate = 0; // assign no alternate function

	HAL_GPIO_Init(GPIOE, &GPIO_InitStructure3); // initialize port E with the handle







}


int main(int argc, char* argv[])
{

//
// Reset of all peripherals, Initializes the Flash interface and the System timer.
//
	HAL_Init();

//
// Configure the system clock
//
	SystemClock_Config();

//
// Display project name with version number
//
	trace_puts(
			"*\n"
			"*\n"
			"* Alarm clock project for stm32f4discovery board V2.00\n"
			"*\n"
			"*\n"
			);

//
// Initialize the seven segment display pins and push buttons
//
	ConfigureDisplay();

//
// Send a greeting to the trace device (skipped on Release).
//
	trace_puts("Initialization Complete");

//
// At this stage the system clock should have already been configured at high speed.
//

	trace_printf("System clock: %u Hz\n", HAL_RCC_GetSysClockFreq() /* SystemCoreClock */ );
    trace_printf( "HClk frequency %u\r\n", HAL_RCC_GetHCLKFreq());
    trace_printf( "PClk 1 frequency %u\r\n", HAL_RCC_GetPCLK1Freq());
    trace_printf( "PClk 2 frequency %u\r\n", HAL_RCC_GetPCLK2Freq());

	Alarm = FALSE;


	RCC_OscInitTypeDef
		RCC_OscInitStruct1;

	RCC_PeriphCLKInitTypeDef
		PeriphClkInitStruct1;

//
// Configure LSI as RTC clock source
//
	RCC_OscInitStruct1.OscillatorType = RCC_OSCILLATORTYPE_LSI;
	RCC_OscInitStruct1.PLL.PLLState = RCC_PLL_NONE;
	RCC_OscInitStruct1.LSIState = RCC_LSI_ON;

	if( HAL_RCC_OscConfig(&RCC_OscInitStruct1) != HAL_OK )
	{
		trace_printf( "HAL_RCC_OscConfig failed\r\n");
		while( TRUE );
	}

//
// Assign the LSI clock to the RTC
//
	PeriphClkInitStruct1.RTCClockSelection = RCC_RTCCLKSOURCE_LSI;
	PeriphClkInitStruct1.PeriphClockSelection = RCC_PERIPHCLK_RTC;
	if(HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct1) != HAL_OK)
	{
		trace_printf( "HAL_RCCEx_PeriphCLKConfig failed\r\n");
		while( TRUE );
	}

//
// Enable the RTC
//
	__HAL_RCC_RTC_ENABLE();

//
// Configure the RTC format and clock divisor
//

	RealTimeClock.Instance = RTC;
	RealTimeClock.Init.HourFormat = RTC_HOURFORMAT_12;

	RealTimeClock.Init.AsynchPrediv = 127;
	RealTimeClock.Init.SynchPrediv = 0xFF;
	RealTimeClock.Init.OutPut = RTC_OUTPUT_DISABLE;
	RealTimeClock.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
	RealTimeClock.Init.OutPutType = RTC_OUTPUT_TYPE_OPENDRAIN;
	HAL_RTC_Init(&RealTimeClock );

//
// Disable the write protection for RTC registers
//
	__HAL_RTC_WRITEPROTECTION_DISABLE( &RealTimeClock );

//
// Disable the Alarm A interrupt
//
	__HAL_RTC_ALARMA_DISABLE( &RealTimeClock );

//
// Clear flag alarm A
//
	__HAL_RTC_ALARM_CLEAR_FLAG(&RealTimeClock, RTC_FLAG_ALRAF);

//
// Structure to set the time in the RTC
//
	ClockTime.Hours = 11;
	ClockTime.Minutes = 00;
	ClockTime.Seconds = 00;
	ClockTime.SubSeconds = 0;
	ClockTime.TimeFormat = RTC_HOURFORMAT_12;
	ClockTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
	ClockTime.StoreOperation = RTC_STOREOPERATION_RESET;

//
// Structure to set the date in the RTC
//

 	ClockDate.Date = 	21;
	ClockDate.Month = 	RTC_MONTH_JUNE;
	ClockDate.WeekDay = RTC_WEEKDAY_WEDNESDAY;
	ClockDate.Year =	17;

//
// Set the date and time in the RTC
//

	HAL_RTC_SetDate(&RealTimeClock, &ClockDate, RTC_FORMAT_BIN);
	HAL_RTC_SetTime(&RealTimeClock, &ClockTime, RTC_FORMAT_BIN);



	HAL_NVIC_SetPriority( RTC_Alarm_IRQn, 0, 0 );
	HAL_NVIC_EnableIRQ( RTC_Alarm_IRQn );


//
// Set the initial alarm time
//
	ClockAlarm.Alarm = RTC_ALARM_A;
	ClockAlarm.AlarmTime.TimeFormat = RTC_HOURFORMAT12_PM;
	ClockAlarm.AlarmTime.Hours = 0x0C;
	ClockAlarm.AlarmTime.Minutes = 0x00;
	ClockAlarm.AlarmTime.Seconds = 0x05;
	ClockAlarm.AlarmMask = RTC_ALARMMASK_DATEWEEKDAY;
	ClockAlarm.AlarmDateWeekDay = 1;
	HAL_RTC_SetAlarm_IT( &RealTimeClock, &ClockAlarm, RTC_FORMAT_BIN );



	Button1 = HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_2);
	Button2 = HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_4);
	Button3 = HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_5);
	Button4 = HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_6);
	Button5 = HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_8);
	DebounceCount1 = 10;
	DebounceCount2 = 10;
	DebounceCount3 = 10;
	DebounceCount4 = 10;
	DebounceCount5 = 10;

//
// Start the display timer (TIM5)
//
	HAL_TIM_Base_Start_IT( &DisplayTimer );

	while ( TRUE )
	{

//
// Wait for an interrupt to occur
//
		__asm__ volatile ( "wfi" );

	}
}

/*
 *
 *  System Clock Configuration
 *
 */

void SystemClock_Config(void)
{

	RCC_OscInitTypeDef RCC_OscInitStruct;
	RCC_ClkInitTypeDef RCC_ClkInitStruct;
	RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;

	__HAL_RCC_PWR_CLK_ENABLE();

	__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
	RCC_OscInitStruct.HSEState = RCC_HSE_ON;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
	RCC_OscInitStruct.PLL.PLLM = 4;
	RCC_OscInitStruct.PLL.PLLN = 168;
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
	RCC_OscInitStruct.PLL.PLLQ = 7;
	HAL_RCC_OscConfig(&RCC_OscInitStruct);

	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
			|RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
	HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5);

