EmilVu/emilvu.github.io/files/ece299-alarm-clock/code/alarm_clock_stm32f4.c
	PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_I2S;
	PeriphClkInitStruct.PLLI2S.PLLI2SN = 192;
	PeriphClkInitStruct.PLLI2S.PLLI2SR = 2;
	HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);

	HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

	HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

	/* SysTick_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}


/*
 * Function: TIM5_IRQHandler
 *
 * Description:
 *
 * 		Timer interrupt handler that is called at a rate of 250Hz.
 *
 * functionality:
 * 		Poll the time and displays it on the 7 segment display
 * 		Checks for button presses and handle any bounce conditions
 * 		Do the appropriate operation based on the button pressed
 *
 */


void TIM5_IRQHandler(void)
{

//
// Validate the correct interrupt has occurred
//

	if( __HAL_TIM_GET_FLAG( &DisplayTimer, TIM_IT_UPDATE ) != RESET )
	{


		GetCurrentTime();

		Display7Segment();

//
// Process any button events
//
		if ( TRUE == CheckButtons())
		{

//
// Debug code
//
		trace_printf( "%04X\n", ButtonsPushed );

			ProcessButtons();
		}
//
// clear the timer interrupt flag
//
		__HAL_TIM_CLEAR_FLAG( &DisplayTimer, TIM_IT_UPDATE );
    }
}


/*
 * Function: RTC_Alarm_IRQHandler
 *
 * Description:
 *
 * When alarm occurs, clear all the interrupt bits and flags then start playing music.
 *
 */

#ifdef USE_RTC

void RTC_Alarm_IRQHandler(void)
{

//
// Verify that this is a real time clock interrupt
//
	if( __HAL_RTC_ALARM_GET_IT( &RealTimeClock, RTC_IT_ALRA ) != RESET )
	{

//
// Clear the alarm flag and the external interrupt flag
//
    	__HAL_RTC_ALARM_CLEAR_FLAG( &RealTimeClock, RTC_FLAG_ALRAF );
    	__HAL_RTC_EXTI_CLEAR_FLAG( RTC_EXTI_LINE_ALARM_EVENT );

//
// Restore the alarm to it's original time. This could have been a snooze alarm
//
    	HAL_RTC_SetAlarm_IT( &RealTimeClock, &ClockAlarm, RTC_FORMAT_BCD );

    	Alarm = TRUE;

	}
}

#endif

/*
 * Function: Display7Segment
 *
 * Description:
 *
 * Displays the current time, alarm time or time format
 *
 */

void Display7Segment(void)
{
//
// clear digit selection bits
//
	HAL_GPIO_WritePin( GPIOC, GPIO_PIN_1, GPIO_PIN_RESET );
	HAL_GPIO_WritePin( GPIOC, GPIO_PIN_2, GPIO_PIN_RESET );
	HAL_GPIO_WritePin( GPIOC, GPIO_PIN_4, GPIO_PIN_RESET );
	HAL_GPIO_WritePin( GPIOC, GPIO_PIN_5, GPIO_PIN_RESET );
	HAL_GPIO_WritePin( GPIOC, GPIO_PIN_6, GPIO_PIN_RESET );
//
// clear segment selection bits
//


	HAL_GPIO_WritePin( GPIOD, GPIO_PIN_0, GPIO_PIN_RESET );
	HAL_GPIO_WritePin( GPIOD, GPIO_PIN_1, GPIO_PIN_RESET );
	HAL_GPIO_WritePin( GPIOD, GPIO_PIN_2, GPIO_PIN_RESET );
	HAL_GPIO_WritePin( GPIOD, GPIO_PIN_3, GPIO_PIN_RESET );
	HAL_GPIO_WritePin( GPIOD, GPIO_PIN_6, GPIO_PIN_RESET );
	HAL_GPIO_WritePin( GPIOD, GPIO_PIN_7, GPIO_PIN_RESET );
	HAL_GPIO_WritePin( GPIOD, GPIO_PIN_8, GPIO_PIN_RESET );
	HAL_GPIO_WritePin( GPIOD, GPIO_PIN_9, GPIO_PIN_RESET );
//
// Select current digit
//

	if(DisplayedDigit==0){
		 HAL_GPIO_WritePin( GPIOC, GPIO_PIN_1, GPIO_PIN_SET );
		 HAL_GPIO_WritePin( GPIOC, GPIO_PIN_2, GPIO_PIN_RESET );
		 HAL_GPIO_WritePin( GPIOC, GPIO_PIN_4, GPIO_PIN_RESET );
		 HAL_GPIO_WritePin( GPIOC, GPIO_PIN_5, GPIO_PIN_RESET );
	}
	if(DisplayedDigit==1){
		 HAL_GPIO_WritePin( GPIOC, GPIO_PIN_1, GPIO_PIN_RESET );
		 HAL_GPIO_WritePin( GPIOC, GPIO_PIN_2, GPIO_PIN_SET );
		 HAL_GPIO_WritePin( GPIOC, GPIO_PIN_4, GPIO_PIN_RESET );
		 HAL_GPIO_WritePin( GPIOC, GPIO_PIN_5, GPIO_PIN_RESET );
	}
	if(DisplayedDigit==2){
		 HAL_GPIO_WritePin( GPIOC, GPIO_PIN_1, GPIO_PIN_RESET );
		 HAL_GPIO_WritePin( GPIOC, GPIO_PIN_2, GPIO_PIN_RESET );
		 HAL_GPIO_WritePin( GPIOC, GPIO_PIN_4, GPIO_PIN_SET );
		 HAL_GPIO_WritePin( GPIOC, GPIO_PIN_5, GPIO_PIN_RESET );
	}
	if(DisplayedDigit==3){
		 HAL_GPIO_WritePin( GPIOC, GPIO_PIN_1, GPIO_PIN_RESET );
		 HAL_GPIO_WritePin( GPIOC, GPIO_PIN_2, GPIO_PIN_RESET );
		 HAL_GPIO_WritePin( GPIOC, GPIO_PIN_4, GPIO_PIN_RESET );
		 HAL_GPIO_WritePin( GPIOC, GPIO_PIN_5, GPIO_PIN_SET );
	}
	if(DisplayedDigit == 4){
		HAL_GPIO_WritePin( GPIOC, GPIO_PIN_6, GPIO_PIN_SET );
	}

//
// Enable segments to be illuminated
//

               if(DisplayedDigit< 4 && BcdTime[DisplayedDigit]==0){

               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_1, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_2, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_3, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_6, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_7, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_8, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_9, GPIO_PIN_RESET );
                  }
                  if(DisplayedDigit< 4 && BcdTime[DisplayedDigit]==1){

               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_1, GPIO_PIN_RESET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_2, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_3, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_6, GPIO_PIN_RESET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_7, GPIO_PIN_RESET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_8, GPIO_PIN_RESET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_9, GPIO_PIN_RESET );

                     }
                  if(DisplayedDigit< 4 && BcdTime[DisplayedDigit]==2){

               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_1, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_2, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_3, GPIO_PIN_RESET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_6, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_7, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_8, GPIO_PIN_RESET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_9, GPIO_PIN_SET );

