EmilVu/emilvu.github.io/files/ece299-alarm-clock/code/alarm_clock_stm32f4.c
                     }
                  if(DisplayedDigit< 4 && BcdTime[DisplayedDigit]==3){

               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_1, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_2, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_3, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_6, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_7, GPIO_PIN_RESET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_8, GPIO_PIN_RESET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_9, GPIO_PIN_SET );

                     }
                  if(DisplayedDigit< 4 && BcdTime[DisplayedDigit]==4){

               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_1, GPIO_PIN_RESET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_2, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_3, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_6, GPIO_PIN_RESET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_7, GPIO_PIN_RESET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_8, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_9, GPIO_PIN_SET );

                     }
                  if(DisplayedDigit< 4 && BcdTime[DisplayedDigit]==5){

               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_1, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_2, GPIO_PIN_RESET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_3, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_6, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_7, GPIO_PIN_RESET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_8, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_9, GPIO_PIN_SET );

                     }
                  if(DisplayedDigit< 4 && BcdTime[DisplayedDigit]==6){

               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_1, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_2, GPIO_PIN_RESET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_3, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_6, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_7, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_8, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_9, GPIO_PIN_SET );

                     }
                  if(DisplayedDigit< 4 && BcdTime[DisplayedDigit]==7){

               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_1, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_2, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_3, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_6, GPIO_PIN_RESET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_7, GPIO_PIN_RESET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_8, GPIO_PIN_RESET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_9, GPIO_PIN_RESET );

                     }
                  if(DisplayedDigit< 4 && BcdTime[DisplayedDigit]==8){

               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_1, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_2, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_3, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_6, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_7, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_8, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_9, GPIO_PIN_SET );

                     }
                  if(DisplayedDigit< 4 && BcdTime[DisplayedDigit]==9){

               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_1, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_2, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_3, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_6, GPIO_PIN_RESET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_7, GPIO_PIN_RESET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_8, GPIO_PIN_SET );
               	   HAL_GPIO_WritePin( GPIOD, GPIO_PIN_9, GPIO_PIN_SET );

                     }
                  if(Alarm == TRUE){
                	  HAL_GPIO_WritePin( GPIOD, GPIO_PIN_0, GPIO_PIN_SET );
                  }
//
// Advance to the next digit to be display on next interrupt
//
               if( DisplayedDigit == 4){
            	   DisplayedDigit = 0;
               }
               else{
            	   DisplayedDigit++;
               }
}


/*
 * Function: SetTime
 *
 * Description:
 *
 * Advance either the time hours or minutes field. Validate the new time and then update the clock
 *
 */

void SetTime(void)
{
	if ( HAL_RTC_WaitForSynchro( &RealTimeClock ) == HAL_OK ){
		if(ButtonsPushed == 0x0011){
                if(SelectedDigitClock == 0 ){
                	if(ClockTime.Hours > 10 ){
                		ClockTime.Hours = ClockTime.Hours-10;
                	}
                }
                if(SelectedDigitClock == 1 ){
                	if(ClockTime.Hours > 01){
                		ClockTime.Hours = ClockTime.Hours-1;
                	}
                }
                if(SelectedDigitClock == 2 ){
                	if(ClockTime.Minutes > 1){
                		ClockTime.Minutes = ClockTime.Minutes-10;

                	}
                }
                if(SelectedDigitClock == 3 ){
                   	if(ClockTime.Minutes > 0){
                    		if(ClockTime.Minutes % 10 > 0){
                    			ClockTime.Minutes = ClockTime.Minutes-1;
                    		}

                    	}
                }
            }

		  if(ButtonsPushed == 0x0012){
              if(SelectedDigitClock == 0 ){
            	  if(ClockTime.Hours < 3 ){
            		  ClockTime.Hours = ClockTime.Hours+10;
            	  }
               }
            if(SelectedDigitClock == 1 ){
            	if(ClockTime.Hours < 10){
            		ClockTime.Hours = ClockTime.Hours+1;
            	}
            }
            if(SelectedDigitClock == 2 ){
            	if(ClockTime.Minutes < 50){
            			ClockTime.Minutes = ClockTime.Minutes + 10;
            	}
            }
            if(SelectedDigitClock == 3 ){
               	if(ClockTime.Minutes < 59){
                		if(ClockTime.Minutes % 10 < 9){
                			ClockTime.Minutes = ClockTime.Minutes+1;
                		}

