EmilVu/emilvu.github.io/files/ece299-alarm-clock/code/alarm_clock_stm32f4.c
                }
            }
	  }
		    ButtonsPushed = 0x0010;
			HAL_RTC_SetDate(&RealTimeClock, &ClockDate, RTC_FORMAT_BIN);
			HAL_RTC_SetTime(&RealTimeClock, &ClockTime, RTC_FORMAT_BIN);
	}
}

/*
 * Function: SetAlarm
 *
 * Description:
 *
 * Advance either the alarm hours or minutes field. Validate the new alarm time and then set the alarm
 *
 */

void SetAlarm(void)
{
	if ( HAL_RTC_WaitForSynchro( &RealTimeClock ) == HAL_OK ){
		if(ButtonsPushed == 0x0009){

            if(SelectedDigitAlarm == 0 ){
            	if(ClockAlarm.AlarmTime.Hours > 10 ){
            		ClockAlarm.AlarmTime.Hours = ClockAlarm.AlarmTime.Hours-10;
            	}
            }
            if(SelectedDigitAlarm == 1 ){
            	if(ClockAlarm.AlarmTime.Hours > 1){
            		ClockAlarm.AlarmTime.Hours = ClockAlarm.AlarmTime.Hours-1;
            	}
            }
            if(SelectedDigitAlarm == 2 ){
            	if(ClockAlarm.AlarmTime.Minutes > 9){
            		ClockAlarm.AlarmTime.Minutes = ClockAlarm.AlarmTime.Minutes-10;

            	}
            }
            if(SelectedDigitAlarm == 3 ){
               	if(ClockAlarm.AlarmTime.Minutes > 0){
                		if(ClockAlarm.AlarmTime.Minutes % 10 > 0){
                			ClockAlarm.AlarmTime.Minutes = ClockAlarm.AlarmTime.Minutes-1;
                		}

                	}
            }
		}
		if(ButtonsPushed == 0x000A){

            if(SelectedDigitAlarm == 0 ){
            	if(ClockAlarm.AlarmTime.Hours < 3 ){
            		ClockAlarm.AlarmTime.Hours = ClockAlarm.AlarmTime.Hours+10;
            	}
            }
            if(SelectedDigitAlarm == 1 ){
            	if(ClockAlarm.AlarmTime.Hours < 9){
            		ClockAlarm.AlarmTime.Hours = ClockAlarm.AlarmTime.Hours+1;
            	}
            }
            if(SelectedDigitAlarm == 2 ){
            	if(ClockAlarm.AlarmTime.Minutes < 49){
            		ClockAlarm.AlarmTime.Minutes = ClockAlarm.AlarmTime.Minutes + 10;
            	}
            }
            if(SelectedDigitAlarm == 3 ){
               	if(ClockAlarm.AlarmTime.Minutes < 59){
                		if(ClockAlarm.AlarmTime.Minutes % 10 < 9){
                			ClockAlarm.AlarmTime.Minutes = ClockAlarm.AlarmTime.Minutes+1;
                		}

                	}
            }
		    }
		a = ClockAlarm.AlarmTime.Hours;
		b = ClockAlarm.AlarmTime.Minutes;
		ButtonsPushed = 0x0008;
		HAL_RTC_SetAlarm_IT( &RealTimeClock, &ClockAlarm, RTC_FORMAT_BIN );
	}
}


/*
 * Function: Snooze
 *
 * Description:
 *
 * Add 10 Minutes to the current time and validate. Update the alarm and enable.
 *
 */

void Snooze(void)
{
	if(Alarm == TRUE){
		if ( HAL_RTC_WaitForSynchro( &RealTimeClock ) == HAL_OK ){
		if(ClockAlarm.AlarmTime.Minutes > 49 ){
			if(ClockTime.Hours == 12 ){
				ClockAlarm.AlarmTime.Hours =  1;
			}else{
			ClockAlarm.AlarmTime.Hours = ClockTime.Hours + 1;
			}
			ClockAlarm.AlarmTime.Minutes = (ClockTime.Minutes+10) % 60 ;
			HAL_RTC_SetAlarm_IT( &RealTimeClock, &ClockAlarm, RTC_FORMAT_BIN );
		}else{
		ClockAlarm.AlarmTime.Hours = ClockTime.Hours;
		ClockAlarm.AlarmTime.Minutes = ClockTime.Minutes+10;
		HAL_RTC_SetAlarm_IT( &RealTimeClock, &ClockAlarm, RTC_FORMAT_BIN );
		}
		}
	}
	Alarm = FALSE;
	ButtonsPushed = 0x0000;
}


/*
 * Function: GetCurrentTime
 *
 * Description:
 *
 * Return either the alarm time or current time in binary coded decimal format store in the array BcdTime.
 *
 */

void GetCurrentTime(void)
{
	if(DisplayMode == 1){
		HAL_RTC_GetTime(&RealTimeClock, &ClockTime, RTC_FORMAT_BIN);
		HAL_RTC_GetDate(&RealTimeClock, &ClockDate, RTC_FORMAT_BIN);

		BcdTime[0] = ClockTime.Hours/10;
		BcdTime[1] = ClockTime.Hours%10;
		BcdTime[2] = ClockTime.Minutes/10;
	    BcdTime[3] = ClockTime.Minutes%10;
	}
	if(DisplayMode == 2){
		HAL_RTC_GetAlarm( &RealTimeClock, &ClockAlarm,RTC_ALARM_A, RTC_FORMAT_BIN );
		BcdTime[0] = ClockAlarm.AlarmTime.Hours/10;
		BcdTime[1] = ClockAlarm.AlarmTime.Hours%10;
		BcdTime[2] = ClockAlarm.AlarmTime.Minutes/10;
	    BcdTime[3] = ClockAlarm.AlarmTime.Minutes%10;

	}

}


/*
 * Function: CheckButtons
 *
 * Description:
 *
 * Check the current state of all the buttons and apply debounce algorithm. Return TRUE with the ButtonPushed
 * variable set indicating the button or buttons pushed if button press is detected.
 *
 */

uint16_t CheckButtons( void )
{

	if(Button1 != HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_2)){
		DebounceCount1--;
		if(DebounceCount1 > 0){
		}
		else{
			Button1 = HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_2);
			DebounceCount1 = 10;
			if(Button1 == GPIO_PIN_RESET){

					ButtonsPushed = 0x0010;

				return (TRUE);
			}
			else{
				ButtonsPushed = 0x0000;
			}
		}
	}
	else{
		DebounceCount1 = 10;
	}

	if(Button2 != HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_4)){
		DebounceCount2--;
		if(DebounceCount2 > 0){
		}
		else{
			Button2 = HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_4);
			DebounceCount2 = 10;
			if(Button2 == GPIO_PIN_RESET){

				ButtonsPushed = 0x0008;
				return (TRUE);
			}else{
				ButtonsPushed = 0x0000;
			}
		}
	}
	else{
		DebounceCount2 = 10;
	}

	if(Button3 != HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_5)){
		DebounceCount3--;
		if(DebounceCount3 > 0){
		}
		else{
			Button3 = HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_5);
			DebounceCount3 = 10;
			if(Button3 == GPIO_PIN_RESET){

					ButtonsPushed = (0x0004|ButtonsPushed);

				return (TRUE);
			}
		}
	}
	else{
		DebounceCount3 = 10;
	}

	if(Button4 != HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_6)){
		DebounceCount4--;
		if(DebounceCount4 > 0){
		}
		else{
			Button4 = HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_6);
			DebounceCount4 = 10;
			if(Button4 == GPIO_PIN_RESET){
				ButtonsPushed = (0x0002|ButtonsPushed);
				return (TRUE);
			}
		}
	}
	else{
		DebounceCount4 = 10;
	}

	if(Button5 != HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_8)){
		DebounceCount5--;
		if(DebounceCount5 > 0){
		}
		else{
			Button5 = HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_8);
			DebounceCount5 = 10;
			if(Button5 == GPIO_PIN_RESET){
				ButtonsPushed = (0x0001|ButtonsPushed);

