EmilVu/emilvu.github.io/files/ece299-alarm-clock/code/alarm_clock_stm32f4.c
				return (TRUE);
			}
		}
	}
	else{
		DebounceCount5 = 10;
	}

	return( FALSE );
}


/*
 * Function: ProcessButtons
 *
 * Description:
 *
 * Test for which button or buttons has been pressed and do the appropriate operation.
 *
 */

void ProcessButtons( void )
{
	if(ButtonsPushed == 0x0000){
		DisplayMode = 1;
	}
	if(ButtonsPushed == 0x0001){
      if(Alarm == TRUE){
    	  Alarm = FALSE;
    	  if ( HAL_RTC_WaitForSynchro( &RealTimeClock ) == HAL_OK ){
    	  ClockAlarm.AlarmTime.Hours = a;
		  ClockAlarm.AlarmTime.Minutes = b;
		  HAL_RTC_SetAlarm_IT( &RealTimeClock, &ClockAlarm, RTC_FORMAT_BIN );
    	  }
      }
      ButtonsPushed = 0x0000;
	}
	if(ButtonsPushed == 0x0002){
		ButtonsPushed = 0x0000;
	}
	if(ButtonsPushed == 0x0004){
      Snooze();
	}
	if(ButtonsPushed == 0x0008){
      DisplayMode = 2;
	}
	if(ButtonsPushed == 0x0009){
		SetAlarm();
	}
	if(ButtonsPushed == 0x000A){
		SetAlarm();
	}
	if(ButtonsPushed == 0x000C){
		if(SelectedDigitAlarm == 3){
			SelectedDigitAlarm = 0;
		}
		else{
			SelectedDigitAlarm++;
		}
		ButtonsPushed = 0x0008;
	}
	if(ButtonsPushed == 0x0010){
     DisplayMode = 1;
	}
	if(ButtonsPushed == 0x0011){
		SetTime();
	}
	if(ButtonsPushed == 0x0012){
		SetTime();
	}
	if(ButtonsPushed == 0x0014){
		if(SelectedDigitClock == 3){
			SelectedDigitClock = 0;
		}
		else{
			SelectedDigitClock++;
		}
		ButtonsPushed = 0x0010;
	}


}


#pragma GCC diagnostic pop

// ----------------------------------------------------------------------------

